{
    "placeholder": "{PLACEHOLDER}",
    "languageSelected": "Français",
    "changeLanguage": "Changer de langue",
    "pageHome": "Accueil",
    "pageWorks": "Travaux",
    "pageSkills": "Compétences",
    "pageContact": "Contact",
    "settings": "Préférences",
    "language": "Langue",
    "french": "Français",
    "english": "English",
    "contactPageTitle": "Besoin de me joindre ?",
    "worksPageTitle": "Mes travaux",
    "phone": "Téléphone",
    "email": "E-mail",
    "linkedin": "LinkedIn",
    "twitter": "X (Twitter)",
    "openLink": "Ouvrir le lien",
    "viewRepo": "Voir le dépôts GitHub",
    "viewSite": "Voir le site",
    "errorNotFound": "Cette page n'existe pas !",
    "goToHomepage": "Revenir à la page d'accueil",
    "call": "Appeler",
    "sendEmail": "Envoyer un e-mail",
    "scanQrCode": "Scanne-moi pour ouvrir le Portfolio sur un autre appareil !",
    "iAm": "Je suis",
    "selfPic": "Photo de moi",
    "avatarImg": "Mon avatar",
    "myCareer": "Mon parcours",
    "presentationParagraph": "Français de 21 ans, passionné de développement de sites et jeux vidéo.\nJ'aime le travail bien fait, découvrir et progresser.",
    "stepMiddleschoolName": "Le collège",
    "stepMiddleschoolText": "C'est là que j'ai commencer à apprendre l'algorithmie tout seul, en développant des fangames sur Scratch.",
    "stepHighschoolName": "Le lycée",
    "stepHighschoolText": "J'ai évoluer de Scratch vers GameMaker et fût introduit au sujet du développement web durant mes cours d'option ISN.",
    "stepSabbaticalTimeName": "Post-bac sabbatique",
    "stepSabbaticalTimeText": "1 an et demi consacré à plein temps à la réalisation de prototypes de jeux dans l'objectif d'apprendre à mieux en faire.",
    "stepBackToEducationName": "Reprise d'étude",
    "stepBackToEducationText": "J'ai choisi d'étudier le développement web car mes compétences acquises avec la réalisation de jeux vidéos me donnent des facilités dans ce domaine.",
    "stepInternshipName": "Alternance front-end",
    "stepInternshipText": "Sous conseil de mes mentors et pour mieux transitionner vers le monde professionel, je suis actuellement en alternance pour me spécialiser sur ReactJS.\n\nPendant ce temps, je continue à améliorer mes compétences en création de jeux.",
    "importance": "Importance",
    "mastery": "Maitrise",
    "novice": "Novice",
    "beginner": "Débutant",
    "intermediate": "Intermédiaire",
    "advanced": "Confirmé",
    "expert": "Expert",
    "thumbnail": "Miniature",
    "filter": "Filtrer",
    "sort": "Trier",
    "searchResult": "Résultat de recherche",
    "searchResults": "Résultats de recherche",
    "totalWorks": "Travaux en tout",
    "totalSkills": "Compétences en tout",
    "ongoing": "En cours",
    "since": "Depuis",
    "firstDay": "1er",
    "january": "Janvier",
    "february": "Février",
    "march": "Mars",
    "april": "Avril",
    "may": "Mai",
    "june": "Juin",
    "jully": "Juillet",
    "august": "Août",
    "september": "Septembre",
    "october": "Octobre",
    "november": "Novembre",
    "december": "Décembre",
    "dateBegin": "Depuis le",
    "dateStart": "Commencé le",
    "dateEnd": "Terminé le",
    "videoGame": "Jeu vidéo",
    "webSite": "Site web",
    "other": "Divers",
    "hardSkill": "Compétence",
    "softSkill": "Compétence",
    "skillUsed": "Compétence utilisée",
    "skillsUsed": "Compétences utilisées",
    "javaScript": "JavaScript",
    "typeScript": "TypeScript",
    "gameMaker": "GameMaker",
    "gameDesign": "Game design",
    "uiDesign": "UI Design",
    "uxDesign": "UX Design",
    "tailwind": "Tailwind CSS",
    "styledComponents": "styled-components",
    "axios": "Axios",
    "sass": "Sass",
    "css": "CSS",
    "html": "HTML",
    "libreOffice": "Libre Office",
    "videoEditing": "Montage vidéo",
    "nextJs": "Next.js",
    "react": "React",
    "mongoDB": "Mongo DB",
    "expressJs": "Express.js",
    "nodeJs": "Node.js",
    "reactNative": "React Native",
    "electron": "Electron",
    "redux": "Redux",
    "scratch": "Scratch",
    "createReactApp": "Create React App",
    "groupomania": "Groupomania",
    "myPortfolio": "Mon Portfolio",
    "superMarioMegalevel": "Super Mario MEGALEVEL",
    "omtbm": "O.M.T.B.M.",
    "omtbm2": "O.M.T.B.M. 2",
    "mbzFramework": "MbzFramework",
    "pekkaSimulator": "P.E.K.K.A.simulator",
    "directBrico": "Direct Brico",
    "ohMyFood": "OhMyFood",
    "argentBank": "Argent Bank",
    "hrNet": "HRnet",
    "scManager": "SurvivalCraft Manager",
    "builderSurvivor": "Builder Survivor",
    "workDescSuperMarioMegalevel": "Ce fangame Super Mario sur PC est mon projet de fin d'année d'ISN en terminale que j'ai continué par la suite. C'est un projet de passion qui rend hommage aux jeux qui m'ont fait découvrir ce hobby.\n\nJ'ai dû créer sa physique de jeu de plateforme, concevoir son contenu tel que les niveaux, organiser le développement de ses mises à jour ou encore ajouter son support de la manette en plus du clavier + souris pour y jouer.\n\nChaque mise à jour est testée par des amis, ce qui m'a par exemple permis de réaliser à quel point la fluidité est insatisfaisante sur certaines machines.\nCela a conduit à une lourde optimisation du jeu lors de la version 4.0, qui a permis une augmentation de plus de 50% des performances malgré la complexification de la physique durant la même mise à jour !\n\nMes compétences en programmation et en conception de niveaux ont énormément évolué durant les 2000 heures de réalisation de ce fangame.\nC'est le projet qui m'a le plus poussé à valoriser l'optimisation des performances, la lisibilité du code et l'attention du détail.",
    "workDescGroupomania": "Le dernier projet de ma 1ère formation OpenClassrooms consistait à développer de A à Z un réseau social interne d'entreprise en utilisant un framework front-end.\n\nJ'ai dû suivre un cahier des charges me demandant d'implémenter des fonctionnalités telles que l'authentification, la publication de posts (avec possibilité d'inclure une image) ou encore la modération.\nEnsuite, j'ai poussé le projet plus loin en ajoutant la possibilité de commenter une publication ou de charger les nouveaux posts automatiquement sans avoir à rafraîchir la page.\nJ'ai également dû concevoir l'interface en suivant une identité graphique définie.\n\nJ'ai pu recontrer quelques difficultés, mais j'ai toujours fini par les surmontés (Par exemple : j'ai dû utiliser axios pour ajouter facilement une image à une publication).\nÀ la fin, le projet fut validé sans problème.\n\nCe gros projet m'a avant tout initié à React, mais a également testé toutes mes compétences acquises jusqu'à présent durant la formation.",
    "workDescMbzFramework": "À force de devoir redévelopper les mêmes systèmes ou utilitaires communs à tous mes jeux (gestion des sons, interpolation d'angles...), j'ai décidé de créer un package GameMaker qui contiendrait tout ce dont j'ai habituellement besoin.\nCe package impose une certaine architecture, abstraction et de la flexibilité, faisant de lui un framework.\n\nJ'ai donc principalement développé des couches d'abstraction supplémentaires (par exemple : les séquences doivent être manipulées avec de nouvelles fonctions afin d'être sous une forme offrant plus de possibilités et de compréhension).\nJ'ai également intégré de nouvelles fonctionnalités telles que la pause et de nombreux utilitaires comme la création de masks.\n\nCe framework accélère et simplifie énormément le développement (par exemple, il est possible de faire une utilisation très pratique des vertex buffers avec l'appel de seulement 2 fonctions intuitives, là où il faut généralement en utiliser plus de 10 de manière compliquée).\nIl est en constante évolution, et à chaque fois que j'ai besoin de développer de nouvelles solutions dont j'aurai besoin dans d'autres projets, elles y sont ajoutés.\n\nJe retravaille également certains de ces aspects au fur et à mesure que mes compétences augmentent grâce au fort lien entre développement de jeux et développement de sites.\nEn effet, les connaissances que j'ai acquises pour l'un vont fréquemment me servir et m'inspirer pour l'autre (par exemple : utiliser la philosophie des composants React pour la gestion de l'interface dans le MbzFramework).",
    "workDescOhMyFood": "Pour le 3ème projet de ma première formation OpenClassrooms, il fallait réaliser le site d'une entreprise fictive permettant de réserver sa place et son menu dans un restaurant pour éviter les temps d'attente sur place.\n\nJ'ai dû créer 5 pages et les relier entre elles.\nQuatre d'entre elles sont des pages de commande (pour différents restaurants) avec une structure identique.\nJ'ai donc commencé par en créer une à partir des maquettes en utilisant du HTML brut.\nUne fois terminée, je l'ai clonée en trois autres pages où je n'avais qu'à modifier le contenu.\nCe projet m'a également demandé de réaliser plusieurs animations CSS, incluant un faux écran de chargement sur la page d'accueil ainsi que l'apparition progressive des plats sur les pages de menu.\n\nOhMyFood fut un projet court qui m'a permis d'en apprendre beaucoup plus sur la mise en forme des pages. Il m'a initié à Sass, aux animations CSS, aux formulaires, le contrôle de version avec Git et GitHub, et m'a fait repousser mes compétences sur certains effets qui m'avaient bien mis en difficulté à l'époque.",
    "workDescArgentBank": "Pour le 13ème projet de ma deuxième formation OpenClassrooms, une banque fictive a eu besoin de créer son application web et notre agence fictive nous a envoyé en mission pour développer la partie front-end.\n\nJ'ai dû transformer les maquettes statiques (HTML/CSS) en un site dynamique avec React.\nJ'ai également dû effectuer des appels API avec Axios (par exemple : pour permettre la connexion à son compte).\nPour facilement avoir accès au jeton d'authentification ou aux informations du compte de l'utilisateur dans les composants, j'ai utilisé Redux en tant que gestionnaire d'état de l'application.\nEnfin, j'ai dû rédiger une documentation Swagger pour décrire les éventuelles routes qui seraient utilisées pour une nouvelle fonctionnalité d'exploration des comptes de l'utilisateur.\n\nArgentBank est le premier projet où j'ai utilisé Redux et Swagger, ainsi que le premier projet que j'ai commencé de zéro où j'ai pu appliquer les connaissances en TypeScript acquises avec l'entreprise dans laquelle j'effectuais mon alternance.",
    "workDescDirectBrico": "DirectBrico était une plateforme de vente d'outils d'occasion pour le bricolage et le jardinage entre particuliers. Je travaillais pour cette startup en télétravail.\n\nJ'ai commencé par travailler sur l'application mobile en collaboration avec une autre personne.\nMon travail consistait principalement à intégrer des maquettes Figma, à retravailler du code existant ainsi que corriger des erreurs et développer de nouvelles fonctionnalités.\nPuis en juin, j'ai participé à la refonte du site web depuis Prestashop vers Next.js avec deux collègues.\nIci, j'ai contribué à la conception architecturale du projet, à la rédaction de tests unitaires et j'ai dû implémenter des sections importantes du site (par exemple : page d'accueil et page produit, y compris l'adaptation aux différentes tailles d'écran !).\nPendant ma période chez DirectBrico, j'ai également participé à de nombreuses réunions, discussions, retours et clarifications au sein d'une équipe d'environ 10 personnes.\n\nLes nombreuses optimisations que j'ai apportées au code et à l'architecture du site ainsi que de l'application ont permis d'améliorer leur maintenabilité.\nLa migration du site vers Next.js a conduit à une amélioration de nos scores de performance Lighthouse, sur grand écran (85→98) comme sur mobile (60→92).\nMalheureusement, la startup a dû fermer en août 2023, faute de ne pas avoir assez atteint son public cible.\n\nAu final, travailler chez DirectBrico m'a permis d'acquérir ou de renforcer mes connaissances en TypeScript, React Native, Next.js, Sass, Redux, Git et GitHub.\nCela a également été ma première expérience professionnelle réelle, me familiarisant ainsi avec le monde du travail et le travail d'équipe impliquant autant de personnes.",
    "workDescHrNet": "Il s'agit du 14ème projet de ma deuxième formation OpenClassrooms.\nNous faisons partie d'une entreprise fictive (Wealth Health) qui possède une application web pour ses ressources humaines (HRnet) nécessitant une refonte, et c'est précisément ce sur quoi porte notre travail.\n\nL'application d'origine utilisait 4 plugins JQuery que j'ai dû convertir en composants React.\nIl nous était également demandé de convertir l'un des quatre plugins en bibliothèque publiée sur npm.\nJ'ai donc aussi créé une petite bibliothèque avec Create React App pour afficher facilement des modales.\nLa partie la plus complexe du projet a été de créer la pagination du tableau affichant la liste des employés, j'ai dû consacrer plusieurs heures pour comprendre le comportement de l'original, concevoir une implémentation, la réaliser et corriger les erreurs.\n\nGrâce à cette refonte, les scores Lighthouse pour le SEO (64→92) ainsi que les performances sur mobile (92→96) sont plus élevés.\nLe code est également bien plus lisible et facile à maintenir.\nJ'ai même pu utiliser la pagination des employés pour mettre en place la pagination des résultats de recherche pour DirectBrico.\n\nEn résumé, j'ai appris beaucoup de choses dans ce projet : que ce soit l'utilisation de Tailwind CSS et une nouvelle architecture avec Next.js avec laquelle je suis fluide, ou encore la création de bibliothèques sur npm, le déploiement sur Vercel ainsi que la mise en place de certaines fonctionnalités que je n'avais jamais réalisées auparavant.",
    "workDescMyPortfolio": "La vitrine de mes projets et compétences qui montre de quoi je suis capable. Vous y êtes, c'est ici !\n\nLa création de ce portfolio m'amène à définir les fonctionnalités nécessaires, puis à concevoir des maquettes visant à combiner une expérience utilisateur fluide avec un design esthétique.\nEnsuite, j'intègre ces maquettes à l'aide de Create React App, TypeScript et styled-components.\nPour le déploiement, j'utilise une bibliothèque pour le faire facilement sur GitHub Pages.\n\nGrâce à lui, je peux présenter facilement mes réalisations à de potentiels collaborateurs, partager mes moyens de contact professionnels et suivre mon parcours.\nDû à sa nature, ce projet est en constante évolution.\n\nCe projet a été la première occasion pour moi de déployer une application web monopage, d'utiliser i18n pour l'affichage des textes et de générer un QR Code pour facilement copier le site sur d'autres appareils.",
    "skillDescGameMaker": "C'est le moteur dont je me sers pour développer mes jeux vidéo.\nIl est idéal pour des projets en 2D grâce à son propre langage de programmation accessible, son éditeur de sprites intégré ainsi que son constructeur de salles.\n\nMon utilisation la plus poussée que j'en fais est dans O.M.T.B.M. 2.\nCe jeu de tir en vue du dessus utilise les fonctionnalités de multijoueur en ligne du moteur, une utilisation poussée des séquences d'animation, des statistiques d'objets héritables ou encore des sons spatialisés.\n\nJ'ai commencé à apprendre à utiliser ce moteur à partir des tutoriels officiels pour créer un jeu simple, tout en modifiant quelques éléments pour tester.\nPour approfondir mes connaissances, j'explore la documentation, je regarde des tutoriels (GameMakerStation m'a été particulièrement utile) et j'expérimente.\n\nAvec GameMaker, j'acquiers beaucoup de notions de programmation plus facilement et je peux me concentrer sur le Game design sans passer trop de temps à implémenter les idées, ce qui est très pratique pour la réalisation de prototypes ou de jeux indépendants.",
    "skillDescTailwind": "Tailwind est un framework CSS qui offre une multitude de classes utilitaires pour appliquer du style à son site, sans avoir à créer des fichiers dédiés.\nCela a pour conséquence de le rendre très efficace avec des éléments composants.\n\nJe l'utilise ainsi dans le 14ème projet de ma seconde formation OpenClassrooms, HRnet, qui utilise Next.js.\nDès qu'un élément doit être utilisé 2 fois ou plus, je crée un composant auquel j'applique les classes Tailwind nécessaires, et le tour est joué.\nJe me sers aussi du fait que le style est défini directement dans le composant pour faire en sorte que la classe varie en fonction du contexte (par exemple, j'utilise une condition qui se base sur des props pour appliquer une classe différente à un bouton en fonction de s'il est pointé par la souris ou non, afin qu'il ait une couleur différente dans ces deux cas).\n\nAprès avoir appris l'existence de Tailwind et sa popularité, j'ai décidé de l'essayer pour HRnet (c'est l'unique utilisation que j'en ai fait actuellement).\nJ'ai commencé par me servir de la documentation et de ChatGPT pour m'aider à le mettre en place dans le projet, puis j'ai continué d'utiliser ces moyens pour apprendre les différentes classes Tailwind existantes.\n\nBien qu'il ne soit pas mon préféré, Tailwind est un framework CSS majeur et son apprentissage me paraît indispensable, afin de pouvoir facilement m'intégrer dans des projets existants ou m'adapter à son utilisation dans de nouveaux projets.",
    "skillDescJavaScript": "Le langage de programmation du web (et pas seulement !).\n\nC'est dans Groupomania que j'ai dû mettre le plus en action mes connaissances en JavaScript.\nLe serveur l'utilise avec Node.js, où mon utilisation la plus complexe a été une fonction asynchrone et récursive qui récupère tous les commentaires d'un post depuis la base de données MongoDB.\nLe client l'utilise avec React, que ce soit pour des appels API réguliers pour charger automatiquement les nouveaux posts ou pour un simple formatage de dates.\n\nPour l'apprentissage des fondamentaux, j'ai commencé l'algorithmie avec Scratch en 2016.\nPour les particularités de JavaScript, sa syntaxe, ses concepts avancés... ça a commencé avec un cours sur OpenClassrooms dans le cadre du projet 5 de ma première formation.\nEnsuite, ce sont StackOverflow et MDN Web Docs qui m'ont aidé à en apprendre davantage.\nEt aujourd'hui, c'est YouTube et ChatGPT qui sont mes meilleurs amis pour consolider ma maîtrise du langage.\n\nL'apprentissage de JavaScript est incontournable dans le développement web.\nC'est le seul langage permettant de rendre les sites dynamiques, il est la fondation de tous les frameworks front-end et capable même de s'occuper du backend.\nIl peut aussi être utilisé pour faire des applications desktop à l'aide d'Electron.js ou mobiles grâce à React Native.\nDévelopper de nouvelles fonctionnalités, résoudre des bugs, écrire du code maintenable ou encore comprendre du code déjà existant sont des choses à ma portée grâce à la bonne maîtrise que j'ai de JavaScript.",
    "skillDescTypeScript": "C'est la surcouche de JavaScript qui permet d'ajouter un type aux variables.\nIci, je ne parle que des particularités de TypeScript lui-même.\n\nCe portfolio est l'un des meilleurs exemples de ma maîtrise de TypeScript.\nJe m'en sers pour définir les types des props que je passe à mes composants, créer des énumérations pour définir les identifiants des compétences, profiter de l'autocomplétion, ou encore pour déterminer le type de données retourné par une fonction.\n\nJ'ai commencé son apprentissage sur YouTube et en travaillant sur DirectBrico.\nAu fil du temps, j'ai continué à renforcer mes compétences en l'utilisant pour répondre à de nouveaux besoins dans mes projets.\n\nPrévention de certaines erreurs, accélération du processus de développement, facilitation de la refonte du code, meilleure lisibilité... Les avantages de TypeScript sont nombreux, ce qui le rend populaire et essentiel à maîtriser dans le domaine du développement web.",
    "skillDescHtml": "C'est le langage de balisage qui structure le contenu de tous les sites internet.\n\nDans des projets sans framework front-end tels que OhMyFood, la moitié de mon travail consistait à écrire du code HTML brut.\nCela demandait de trouver une structure à partir des maquettes, de choisir les bonnes balises sémantiques, de construire un formulaire ou encore de remplir l'en-tête de la page avec des informations telles que le titre ou l'icône.\n\nJ'ai dû apprendre au moins 70 % des choses que je sais sur ce langage dans le célèbre cours OpenClassrooms dédié à la création de sites web.\nLe reste provient d'autres cours OpenClassrooms et de tutoriels sur YouTube.\n\nComprendre le fonctionnement de l'HTML est obligatoire en développement web.\nC'est ce qui permet de construire le squelette d'un site, d'optimiser son référencement naturel (SEO) ou de savoir l'utiliser dans un framework front-end tel que Next.js pour le rendu des composants.",
    "skillDescCss": "Le langage pour ajouter du style à son site !\n\nOhMyFood est le projet qui m'a demandé le plus d'efforts dans l'utilisation de cette compétence, que ce soit pour gérer l'adaptation du site à la taille de l'écran, réaliser des animations et des transitions, ou encore présenter le contenu de façon esthétique.\n\nJ'ai commencé par apprendre les bases grâce au cours OpenClassrooms dédié à la création de sites web simples.\nEnsuite, j'approfondis mes compétences en faisant des recherches (StackOverflow, ChatGPT, expérimentations) lorsque des effets que je ne connais pas me sont demandés, ou en suivant des chaînes YouTube qui présentent des effets avancés et expliquent comment les reproduire.\n\nUne bonne maîtrise du CSS permet de rendre l'utilisation du site agréable et peut également laisser une forte impression à l'utilisateur grâce à des effets spectaculaires.\nC'est donc une compétence indispensable à approfondir pour tout développeur front-end !",
    "skillDescNextJs": "Next.js est un framework frontend basé sur React qui simplifie et accélère le développement de sites grâce à son niveau d'abstraction.\n\nJe l'ai utilisé dans le projet HRnet de ma deuxième formation OpenClassrooms pour m'entraîner.\nIl m'a permis d'initialiser le projet facilement, de créer une architecture très intuitive, et même d'intégrer facilement Tailwind CSS.\n\nJ'ai été introduit à Next.js lorsque j'ai travaillé sur la refonte du site DirectBrico.\nNotre CTO l'avait choisi pour les nombreux avantages qu'il offre, tels que son excellent support de Sass et son optimisation des performances.\nJ'ai pu en apprendre davantage en lisant la documentation officielle.\nCependant, je reste débutant dans sa maîtrise, donc il me reste encore beaucoup à apprendre.\n\nIl est l'un des frameworks les plus populaires, notamment grâce à son adoption par de grands sites tels que Twitch.\nSes mises à jour régulières lui permettent de rester à la pointe de l'évolution de l'industrie.\nC'est pour toutes ces raisons que je m'investis dedans.",
    "skillDescRedux": "C'est un gestionnaire d'état d'application, ce qui permet de faciliter la manipulation des données entre différentes fonctionnalités d'un site internet, par exemple.\n\nMon utilisation de Redux la plus approfondie à ce jour s'est produite dans le contexte du 13ème projet de ma deuxième formation OpenClassrooms, ArgentBank.\nJ'ai dû le combiner à React pour que les composants puissent aisément utiliser le jeton d'authentification et les informations de l'utilisateur connecté (par exemple : pour que le texte qui affiche le nom de l'utilisateur puisse accéder facilement à sa valeur).\n\nToutes mes connaissances actuelles sur Redux ont été acquises grâce au cours OpenClassrooms qui lui est dédié.\n\nL'utilisation d'un gestionnaire d'état efficace est de plus en plus essentielle à mesure que les sites deviennent plus complexes.\nRedux est l'un des meilleurs candidats pour cette tâche en raison de sa prévisibilité, de sa scalabilité, de sa flexibilité et de sa facilité de débogage grâce aux Redux DevTools.",
    "skillDescCreateReactApp": "Create React App est un framework frontend basé sur React qui se veut simple et flexible d'architecture.\n\nJe l'ai utilisé pour créer le client de Groupomania (le 7ème projet de ma première formation chez OpenClassrooms).\nJ'ai défini une architecture très personnalisée avec laquelle j'ai pu être à l'aise et développer rapidement l'outil grâce à React et à la fonctionnalité de rechargement automatique de la page à chaque sauvegarde des changements dans le code.\n\nTout comme React, j'ai appris à utiliser Create React App sur OpenClassrooms grâce aux cours qui lui sont consacrés.\nCependant, je n'ai pas encore eu besoin d'approfondir certaines notions, comme l'éjection de l'application.\n\nCe framework est idéal pour débuter ou construire des applications web simples, telles que des prototypes ou certains outils internes à une entreprise.",
    "skillDescReact": "Une bibliothèque JavaScript permettant de créer des interfaces dynamiques d'applications web en se basant sur l'utilisation de composants réutilisables.\n\nCe portfolio compte parmi les meilleures utilisations de React que j'ai faites.\nEn donnant des noms explicites aux composants, la structure des pages est très facilement maintenable.\nJe sépare l'affichage et les données en les isolant (par exemple : un fichier contient un tableau d'informations sur les travaux, et un autre fichier les affiche automatiquement à partir du tableau).\nJ'utilise également beaucoup de hooks, que ce soit un useEffect pour gérer l'affichage de la modale que vous êtes en train de consulter actuellement, ou un hook personnalisé pour formater les dates.\n\nJ'ai commencé à apprendre React à travers les cours dédiés sur OpenClassrooms, et je continue d'approfondir mes connaissances sur YouTube grâce aux très nombreux tutoriels qui explorent tous ces concepts, les bonnes pratiques ainsi que des exemples d'implémentation de fonctionnalités spécifiques.\n\nLa simplicité de lecture de son code, l'accélération du développement et scalabilité possible grâce à la réutilisabilité des composants ou encore ses fonctionnalités d'optimisation des performances, sont toutes des raisons qui font sa popularité.\nAinsi, React s'impose comme l'une des meilleures façons de manipuler l'interface pour développer rapidement et confortablement des sites internet de plus en plus complexes.",
    "skillDescStyledComponents": "Cette bibliothèque permet d'appliquer du style localisé sur des composants React précis.\n\nJ'utilise styled-components dans ce portfolio.\nCela me permet d'utiliser la syntaxe CSS que je connais bien, avec la possibilité de rendre le style dynamique (par exemple : cela permet de faire varier la couleur de la bordure de la miniature d'un travail en fonction de son type).\n\nJ'ai appris à utiliser cette bibliothèque dans le cours OpenClassrooms dédié à React, puis j'ai eu quelques occasions d'approfondir avec ChatGPT lorsque j'ai eu besoin de faire des choses que je ne savais pas faire.\n\nstyled-components est une solution moderne pour ajouter du style à ces applications React en simplifiant l'utilisation du contexte dans le style et en localisant le style pour le rendre plus facile à maintenir.",
    "skillDescSass": "Un puissant préprocesseur CSS permettant de développer plus efficacement le style de son site.\n\nJ'ai notamment utilisé Sass lors de la refonte du site DirectBrico.\nJ'ai dû créer des modules pour appliquer du style exclusif aux composants, contribuer à la définition de l'utilisation des variables globales avec l'équipe, ou encore utiliser l'héritabilité pour éviter de répéter inutilement du code similaire.\n\nJ'ai commencé son apprentissage avec le cours OpenClassrooms qui lui est dédié.\nMaintenant, c'est en utilisant ChatGPT pour réaliser certains effets et le questionner sur les points que je ne comprends pas que j'en apprends plus à son sujet.\n\nAvec ses nombreuses fonctionnalités telles que les mixins, les variables ou la réalisation de modules, Sass accélère le développement en limitant la répétitivité du code et en améliorant sa lisibilité.\nIl est également facilement intégrable à la plupart des frameworks frontend modernes tels que Next.js ou Create React App.",
    "skillDescNodeJs": "Node.js permet d'exécuter du code JavaScript en dehors d'un navigateur web.\n\nJe m'en suis servi pour réaliser l'API du dernier projet de ma première formation sur OpenClassrooms : Groupomania.\nJ'ai dû manipuler des modules dont la racine est un fichier exécuté au lancement du serveur afin de traiter les différentes requêtes qu'il reçoit (par exemple : pour créer un compte, aimer une publication, etc.).\n\nLes connaissances actuelles que j'en ai proviennent du cours OpenClassrooms dédié à Node.js, Express.js et MongoDB.\n\nSon architecture basée sur des modules, sa compatibilité entre plateformes et ses outils inclus sont toutes des raisons qui le rendent viable pour développer des serveurs.\nCela offre ainsi la possibilité de réaliser des applications web complètes (frontend + backend) sans avoir à apprendre un autre langage que JavaScript.",
    "skillDescExpressJs": "Express.js est un framework basé sur Node.js pour développer des serveurs d'application web.\n\nLa meilleure utilisation que j'en ai faite a été lors de la réalisation de l'API pour le dernier projet de ma première formation chez OpenClassrooms (Groupomania).\nJ'ai créé les fonctions middleware qui se chargent de traiter les requêtes pour chaque route.\nJ'ai également pu l'associer à d'autres bibliothèques comme json-web-token pour gérer l'authentification des utilisateurs ou à mongoose pour la liaison à la base de données.\n\nMes connaissances actuelles à son sujet proviennent du cours OpenClassrooms dédié à Node.js, Express.js et MongoDB.\n\nSa flexibilité et sa simplicité en ont fait un choix populaire, couramment associé à MongoDB et React, qui sont deux autres technologies que j'utilise.",
    "skillDescMongoDb": "MongoDB est une base de données non relationnelle connue pour sa polyvalence et son format de données similaire à la notation des objets JavaScript.\n\nJe l'ai utilisée pour stocker les données des utilisateurs du dernier projet de ma première formation OpenClassrooms (Groupomania).\nJ'ai créé une collection pour les Comptes et une autre pour les Publications, que j'ai ensuite manipulées côté serveur pour ajouter, modifier, supprimer et récupérer du contenu.\n\nMes connaissances actuelles à son sujet proviennent du cours OpenClassrooms dédié à Node.js, Express.js et MongoDB.\n\nSa popularité viens de sa simplicité de mise à l'échelle, sa flexibilité grâce à l'absence de schéma de données fixe, ainsi que de ses nombreuses fonctionnalités de requêtes.\nElle est fréquemment associée à Express.js et React pour maintenir une consistance de l'utilisation de JavaScript."
}
